Revit 2020 API
DocumentEntryPoint.Link Method
Overload List
Name | Description
Link(String, DWFImportOptions)
 Links Markups in a DWF file to the document.
 (Inherited from Document.)
Link(String, SATImportOptions, View)
 Links an SAT file into the document.
 (Inherited from Document.)
Link(String, SKPImportOptions, View)
 Links an SKP file into the document.
 (Inherited from Document.)
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file to the document.
 (Inherited from Document.)
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file to the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace